Tekla Open API Reference for Tekla Structures 2025
MaterialItem.Insert Method
 Inserts this material item to material database.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Insert()
Public Function Insert As Boolean
Return Value
Type: Boolean
 True on success. False if operation failed. Possible reasons: material name is invalid; a material with the same name already exists in database.
See Also
Reference
MaterialItem Class
Tekla.Structures.Catalogs Namespace